{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": {
    "base_model_class": "GLiNER2",
    "parent_library": "gliner2.inference.engine"
  },
  "base_model_name_or_path": "fastino/gliner2-base-v1",
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32.0,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.18.1",
  "qalora_group_size": 16,
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "count_pred.2",
    "linear1",
    "out_proj",
    "in_projector",
    "project_start.3",
    "value_proj",
    "query_proj",
    "classifier.2",
    "linear2",
    "count_pred.0",
    "key_proj",
    "out_projector.4",
    "project_end.3",
    "out_project.0",
    "project_end.0",
    "project_start.0",
    "dense",
    "out_project.3",
    "out_projector.0",
    "classifier.0",
    "out_projector.2"
  ],
  "target_parameters": null,
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}